'''
7648:蓄水池水管问题
查看提交统计提问
总时间限制: 1000ms 内存限制: 65536kB
描述
蓄水池有甲、丙两条进水管和乙、丁两条排水管。

要灌满一池水，单开甲管需要a小时，单开丙管需要c小时；要排光一池水，单开乙管需要b小时，单开丁管需要d小时。

现在池内没有水，如果按甲乙丙丁的顺序循环单开各水管，每次每管开1小时，则多长时间后水开始溢出水池？

保证一定会在有限时间内出现水溢出水池的情况。

输入
一行，四个不大于10的正整数a，b，c，d，两个整数之间用单个空格隔开。a < b, c < d
输出
一个浮点数，即水溢出水池的时间。舍入到小数点后两位。
样例输入
3 4 5 6
样例输出
24.90
来源
《奥数典型题举一反三（小学六年级）》 (ISBN 978-7-5445-2883-2) 第二章 第二讲 习题15
'''



a,b,c,d = input().split()
a = int(a)
b = int(b)
c = int(c)
d = int(d)
s = 0 #当前水量
i = 0 #耗时
zq = 0
while True:
    #a 加水
    if (s + 1/a)>=1:
        t = (1-s)/(1/a)
        i = i + t
        # s = s + 1/a*t = 1
        print('a',i)
        break
    else:
        s = s + 1/a
        i = i + 1

    #b 减水
    s = s - 1/b
    i = i + 1
    # 加水
    if (s + 1/c)>=1:
        t = (1-s)/(1/c)
        i = i + t
        # s = s + 1/a*t = 1
        print('c',i)
        break
    else:
        s = s + 1/c
        i = i + 1

    #d 减水
    s = s - 1/d
    i = i + 1
    zq = zq + 1
    print('----------',zq)


# while True:

#     if s + 1/a < 1: #不会在此1小时内溢出；
#         i += 1
#         s += 1/a
#     else:
#         i += (1-s)/(1/a)
#         break
#     i += 1
#     s -= 1/b

#     if s + 1/c < 1: #不会在此1小时内溢出；
#         i += 1
#         s += 1/c
#     else:
#         i += (1-s)/(1/c)
#         break
#     i += 1
#     s -= 1/d

print('%.2f'%i)